tap "aws/tap"
tap "cockroachdb/tap"
tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "nikaro/tap"
tap "tilt-dev/tap"
brew "act"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "pcre2"
brew "glib"
brew "xorgproto"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "lzo"
brew "pixman"
brew "cairo"
brew "giflib"
brew "graphite2"
brew "icu4c"
brew "harfbuzz"
brew "jpeg-turbo"
brew "lz4"
brew "xz"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "apache-spark"
brew "ca-certificates"
brew "mpdecimal"
brew "openssl@1.1"
brew "openssl@3"
brew "readline"
brew "python@3.11"
brew "asciinema"
brew "m4"
brew "autoconf"
brew "aws-iam-authenticator"
brew "docutils"
brew "six"
brew "awscli"
brew "bash"
brew "bat"
brew "capstone"
brew "cmake"
brew "gmp"
brew "libevent"
brew "libunistring"
brew "libidn2"
brew "libnghttp2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libslirp"
brew "libssh"
brew "libusb"
brew "ncurses"
brew "snappy"
brew "vde"
brew "qemu"
brew "lima"
brew "colima"
brew "coreutils"
brew "ctop"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "fd"
brew "fnm"
brew "fzf"
brew "fzy"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "go"
brew "msgpack"
brew "helm"
brew "htop"
brew "hyperfine"
brew "jpeg"
brew "oniguruma"
brew "jq"
brew "k6"
brew "kind"
brew "kubernetes-cli"
brew "kubectx"
brew "libpq"
brew "unibilium"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "luajit"
brew "luv"
brew "mariadb"
brew "mkcert"
brew "tree-sitter"
brew "neovim"
brew "newsboat"
brew "nss"
brew "openjdk"
brew "pkg-config"
brew "pre-commit"
brew "pstree"
brew "pyenv"
brew "ripgrep"
brew "slides"
brew "smartmontools"
brew "stern"
brew "telnet"
brew "terraform"
brew "transmission-cli"
brew "vault"
brew "watch"
brew "wget"
brew "xdg-ninja"
brew "xplr"
brew "zoxide"
brew "aws/tap/aws-sam-cli"
brew "cockroachdb/tap/cockroach"
brew "derailed/k9s/k9s"
brew "tilt-dev/tap/ctlptl"
brew "tilt-dev/tap/tilt"
cask "authy"
cask "chromedriver"
cask "finicky"
cask "firefox"
cask "hammerspoon"
cask "kitty"
cask "microsoft-teams"
cask "miniconda"
cask "ngrok"
cask "obsidian"
cask "rar"
cask "spotify"
cask "visual-studio-code"
cask "wezterm"
vscode "eamodio.gitlens"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "tcwalther.cython"
