tap "hashicorp/tap"
tap "mongodb/brew"
tap "oven-sh/bun"
brew "abseil"
brew "act"
brew "giflib"
brew "jpeg-turbo"
brew "libpng"
brew "lz4"
brew "xz"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "ca-certificates"
brew "libunistring"
brew "gettext"
brew "openssl@3"
brew "readline"
brew "aria2"
brew "m4"
brew "autoconf"
brew "mpdecimal"
brew "awscli"
brew "oniguruma"
brew "bat"
brew "libnghttp2"
brew "libuv"
brew "bitwarden-cli"
brew "bob"
brew "btop"
brew "freetype"
brew "fontconfig"
brew "pcre2"
brew "glib"
brew "xorgproto"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "lzo"
brew "pixman"
brew "cairo"
brew "capstone"
brew "certifi"
brew "chezmoi"
brew "cmake"
brew "lima"
brew "colima", restart_service: :changed
brew "commitizen"
brew "gmp"
brew "coreutils"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "doggo"
brew "duckdb"
brew "dust"
brew "dysk"
brew "eza"
brew "fd"
brew "libevent"
brew "libidn2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "graphite2"
brew "harfbuzz"
brew "libssh"
brew "snappy"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "fzy"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "gitleaks"
brew "glow"
brew "gnu-sed"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "go"
brew "graphviz"
brew "grc"
brew "gum"
brew "hadolint"
brew "helm"
brew "hexyl"
brew "ncurses"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "jq"
brew "k6"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "libomp"
brew "libslirp"
brew "llama.cpp"
brew "llvm"
brew "luajit"
brew "luv"
brew "micromamba"
brew "ollama"
brew "openapi-generator"
brew "pinentry-mac"
brew "pipx"
brew "pkgconf"
brew "poetry"
brew "postgresql@17"
brew "pre-commit"
brew "pv"
brew "pyenv"
brew "ripgrep"
brew "rmlint"
brew "ruby"
brew "selene"
brew "shellcheck"
brew "shfmt"
brew "stern"
brew "stylua"
brew "task"
brew "taskwarrior-tui"
brew "telnet"
brew "tenere"
brew "tfenv"
brew "timg"
brew "tlrc"
brew "tokei"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "unixodbc"
brew "uv"
brew "vde"
brew "viddy"
brew "watch"
brew "wget"
brew "yazi"
brew "yq"
brew "zig"
brew "zoxide"
brew "hashicorp/tap/vault"
brew "mongodb/brew/mongodb-community"
brew "oven-sh/bun/bun"
cask "1password"
cask "1password-cli"
cask "android-studio"
cask "background-music"
cask "bruno"
cask "calibre"
cask "devpod"
cask "discord"
cask "flutter"
cask "font-annotation-mono"
cask "font-codicon"
cask "font-ia-writer-mono"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-juliamono"
cask "font-lato"
cask "font-literata"
cask "font-maple-mono"
cask "font-martian-mono"
cask "font-merriweather"
cask "font-monocraft"
cask "font-new-york"
cask "font-nonicons"
cask "font-noto-color-emoji"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
cask "font-zed-mono"
cask "git-credential-manager"
cask "google-chrome"
cask "helium-browser"
cask "kindle-previewer"
cask "kitty"
cask "monitorcontrol"
cask "obsidian"
cask "postman"
cask "qbittorrent"
cask "rar"
cask "raycast"
cask "send-to-kindle"
cask "tor-browser"
cask "transmission"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zen"
vscode "anthropic.claude-code"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "humao.rest-client"
vscode "johnpapa.vscode-peacock"
vscode "leetcode.vscode-leetcode"
vscode "mads-hartmann.bash-ide-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "oderwat.indent-rainbow"
vscode "pycqa.bandit-pycqa"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "vscjava.vscode-gradle"
vscode "yzane.markdown-pdf"
