tap "aws/tap"
tap "caarlos0/tap"
tap "cockroachdb/tap"
tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "oven-sh/bun"
tap "tilt-dev/tap"
brew "act"
brew "giflib"
brew "jpeg-turbo"
brew "libpng"
brew "lz4"
brew "xz"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "ca-certificates"
brew "mpdecimal"
brew "openssl@3"
brew "pcre2"
brew "readline"
brew "glib"
brew "xorgproto"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "lzo"
brew "pixman"
brew "cairo"
brew "graphite2"
brew "icu4c"
brew "harfbuzz"
brew "apache-spark"
brew "asciinema"
brew "m4"
brew "autoconf"
brew "aws-iam-authenticator"
brew "certifi"
brew "aws-sam-cli"
brew "python@3.11"
brew "awscli"
brew "bash"
brew "oniguruma"
brew "bat"
brew "libnghttp2"
brew "libuv"
brew "bitwarden-cli"
brew "gmp"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "btop"
brew "capstone"
brew "ccache"
brew "chezmoi"
brew "cmake"
brew "libevent"
brew "libunistring"
brew "libidn2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libslirp"
brew "libssh"
brew "libusb"
brew "ncurses"
brew "snappy"
brew "vde"
brew "qemu"
brew "lima"
brew "colima", restart_service: true
brew "commitizen"
brew "coreutils"
brew "ctop"
brew "devcontainer"
brew "docker"
brew "docker-buildx", link: false
brew "docker-compose", link: false
brew "docutils"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "fzy"
brew "gh"
brew "git"
brew "git-delta"
brew "glab"
brew "glow"
brew "gnu-sed"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "npth"
brew "pinentry"
brew "gnupg", link: false
brew "go"
brew "grip"
brew "msgpack"
brew "helm"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "k6"
brew "kind"
brew "kubernetes-cli"
brew "kubectx"
brew "lazygit"
brew "libpq"
brew "unibilium"
brew "libtermkey"
brew "libvterm"
brew "llvm"
brew "luajit"
brew "luv"
brew "mariadb"
brew "minikube"
brew "mkcert"
brew "tree-sitter"
brew "neovim", args: ["HEAD"]
brew "newsboat"
brew "ninja"
brew "nss"
brew "openjdk"
brew "openssl@1.1"
brew "pandoc"
brew "pinentry-mac"
brew "pipx"
brew "pkg-config"
brew "poetry"
brew "pre-commit"
brew "pstree"
brew "pybind11"
brew "pyenv"
brew "six"
brew "ripgrep"
brew "selene"
brew "slides"
brew "smartmontools"
brew "stern"
brew "stylua"
brew "telnet"
brew "tfenv"
brew "transmission-cli"
brew "unixodbc"
brew "vault"
brew "watch"
brew "watchman"
brew "wget"
brew "xplr"
brew "yq"
brew "zoxide"
brew "caarlos0/tap/timer"
brew "cockroachdb/tap/cockroach"
brew "derailed/k9s/k9s"
brew "oven-sh/bun/bun"
brew "tilt-dev/tap/ctlptl"
brew "tilt-dev/tap/tilt"
cask "authy"
cask "basictex"
cask "chromedriver"
cask "finicky"
cask "firefox"
cask "flutter"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "git-credential-manager"
cask "hammerspoon"
cask "keycastr"
cask "kitty"
cask "macs-fan-control"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "miniconda"
cask "monitorcontrol"
cask "neovide"
cask "ngrok"
cask "obsidian"
cask "rar"
cask "spotify"
cask "utm"
cask "visual-studio-code"
cask "wezterm-nightly"
cask "whatsapp"
cask "wireshark"
cask "zoom"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "sumneko.lua"
vscode "vue.volar"
vscode "yzhang.markdown-all-in-one"
