tap "aws/tap"
tap "caarlos0/tap"
tap "cockroachdb/tap"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "mongodb/brew"
tap "oven-sh/bun"
tap "tilt-dev/tap"
brew "act"
brew "giflib"
brew "jpeg-turbo"
brew "libpng"
brew "lz4"
brew "xz"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "m4"
brew "autoconf"
brew "aws-vault"
brew "ca-certificates"
brew "openssl@3"
brew "mpdecimal"
brew "readline"
brew "awscli"
brew "oniguruma"
brew "bat"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "pcre2"
brew "glib"
brew "xorgproto"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "lzo"
brew "pixman"
brew "cairo"
brew "capstone"
brew "ccache"
brew "certifi"
brew "cmake"
brew "gmp"
brew "libevent"
brew "libunistring"
brew "libidn2"
brew "libnghttp2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libslirp"
brew "libssh"
brew "libusb"
brew "ncurses"
brew "snappy"
brew "vde"
brew "qemu"
brew "lima"
brew "colima", restart_service: true
brew "commitizen"
brew "coreutils"
brew "ctop"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docutils"
brew "eza"
brew "fd"
brew "graphite2"
brew "icu4c"
brew "harfbuzz"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "fzy"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "npth"
brew "pinentry"
brew "gnupg", link: false
brew "go"
brew "helm"
brew "htop"
brew "httpie"
brew "jq"
brew "k6"
brew "kubernetes-cli"
brew "kubectx"
brew "libuv"
brew "libvterm"
brew "llvm"
brew "luajit"
brew "luv"
brew "msgpack"
brew "tree-sitter"
brew "unibilium"
brew "neovim"
brew "ninja"
brew "openssl@1.1"
brew "pinentry-mac"
brew "pipx"
brew "pkg-config"
brew "poetry"
brew "pre-commit"
brew "pyenv"
brew "ripgrep"
brew "selene"
brew "stern"
brew "stylua"
brew "telnet"
brew "tfenv"
brew "unixodbc"
brew "watch"
brew "wget"
brew "yq"
brew "zoxide"
brew "derailed/k9s/k9s"
brew "hashicorp/tap/vault"
brew "mongodb/brew/mongodb-community"
brew "oven-sh/bun/bun"
brew "tilt-dev/tap/ctlptl"
brew "tilt-dev/tap/tilt"
cask "finicky"
cask "font-codicon"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-nonicons"
cask "font-recursive-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-zed-mono"
cask "git-credential-manager"
cask "kitty"
cask "obsidian"
cask "rar"
cask "visual-studio-code"
cask "whatsapp"
vscode "antfu.goto-alias"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "file-icons.file-icons"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "nuxt.mdc"
vscode "nuxtr.nuxt-vscode-extentions"
vscode "nuxtr.nuxtr-vscode"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sumneko.lua"
vscode "tim-koehler.helm-intellisense"
vscode "vue.volar"
vscode "yzhang.markdown-all-in-one"
